lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_reg.h
/** \brief  508, ISP Acquisition Horizontal Offset Register */
#define CIF_ISP_ACQ_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_H_OFFS*)0xF90E2408u)

/** Alias (User Manual Name) for CIF_ISP_ACQ_H_OFFS.
* To use register names with standard convension, please use CIF_ISP_ACQ_H_OFFS.
*/
#define	CIFISP_ACQ_H_OFFS	(CIF_ISP_ACQ_H_OFFS)

/** \brief  510, ISP Acquisition Horizontal Size Register */
#define CIF_ISP_ACQ_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_H_SIZE*)0xF90E2410u)

/** Alias (User Manual Name) for CIF_ISP_ACQ_H_SIZE.
* To use register names with standard convension, please use CIF_ISP_ACQ_H_SIZE.
*/
#define	CIFISP_ACQ_H_SIZE	(CIF_ISP_ACQ_H_SIZE)

/** \brief  518, ISP Acquisition Number of Frames Register */
#define CIF_ISP_ACQ_NR_FRAMES /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_NR_FRAMES*)0xF90E2418u)

/** Alias (User Manual Name) for CIF_ISP_ACQ_NR_FRAMES.
* To use register names with standard convension, please use CIF_ISP_ACQ_NR_FRAMES.
*/
#define	CIFISP_ACQ_NR_FRAMES	(CIF_ISP_ACQ_NR_FRAMES)

/** \brief  504, ISP Acquisition Properties Register */
#define CIF_ISP_ACQ_PROP /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_PROP*)0xF90E2404u)

/** Alias (User Manual Name) for CIF_ISP_ACQ_PROP.
* To use register names with standard convension, please use CIF_ISP_ACQ_PROP.
*/
#define	CIFISP_ACQ_PROP	(CIF_ISP_ACQ_PROP)

/** \brief  50C, ISP Acquistion Vertical Offset Register */
#define CIF_ISP_ACQ_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_V_OFFS*)0xF90E240Cu)

/** Alias (User Manual Name) for CIF_ISP_ACQ_V_OFFS.
* To use register names with standard convension, please use CIF_ISP_ACQ_V_OFFS.
*/
#define	CIFISP_ACQ_V_OFFS	(CIF_ISP_ACQ_V_OFFS)

/** \brief  514, ISP Acquisition Vertical Size Register */
#define CIF_ISP_ACQ_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_V_SIZE*)0xF90E2414u)

/** Alias (User Manual Name) for CIF_ISP_ACQ_V_SIZE.
* To use register names with standard convension, please use CIF_ISP_ACQ_V_SIZE.
*/
#define	CIFISP_ACQ_V_SIZE	(CIF_ISP_ACQ_V_SIZE)

/** \brief  500, ISP Global Control Register */
#define CIF_ISP_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_CTRL*)0xF90E2400u)

/** Alias (User Manual Name) for CIF_ISP_CTRL.
* To use register names with standard convension, please use CIF_ISP_CTRL.
*/
#define	CIFISP_CTRL	(CIF_ISP_CTRL)

/** \brief  73C, ISP Error Register */
#define CIF_ISP_ERR /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ERR*)0xF90E263Cu)

/** Alias (User Manual Name) for CIF_ISP_ERR.
* To use register names with standard convension, please use CIF_ISP_ERR.
*/
#define	CIFISP_ERR	(CIF_ISP_ERR)

/** \brief  740, ISP Error Clear Register */
#define CIF_ISP_ERR_CLR /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ERR_CLR*)0xF90E2640u)

/** Alias (User Manual Name) for CIF_ISP_ERR_CLR.
* To use register names with standard convension, please use CIF_ISP_ERR_CLR.
*/
#define	CIFISP_ERR_CLR	(CIF_ISP_ERR_CLR)

/** \brief  6A8, ISP Shadow Flags Register */
#define CIF_ISP_FLAGS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_FLAGS_SHD*)0xF90E25A8u)

/** Alias (User Manual Name) for CIF_ISP_FLAGS_SHD.
* To use register names with standard convension, please use CIF_ISP_FLAGS_SHD.
*/
#define	CIFISP_FLAGS_SHD	(CIF_ISP_FLAGS_SHD)

/** \brief  744, ISP Frame Counter Register */
#define CIF_ISP_FRAME_COUNT /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_FRAME_COUNT*)0xF90E2644u)

/** Alias (User Manual Name) for CIF_ISP_FRAME_COUNT.
* To use register names with standard convension, please use CIF_ISP_FRAME_COUNT.
*/
#define	CIFISP_FRAME_COUNT	(CIF_ISP_FRAME_COUNT)

/** \brief  6C8, ISP Interrupt Clear Register */
#define CIF_ISP_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ICR*)0xF90E25C8u)

/** Alias (User Manual Name) for CIF_ISP_ICR.
* To use register names with standard convension, please use CIF_ISP_ICR.
*/
#define	CIFISP_ICR	(CIF_ISP_ICR)

/** \brief  6BC, ISP Interrupt Mask Register */
#define CIF_ISP_IMSC /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_IMSC*)0xF90E25BCu)

/** Alias (User Manual Name) for CIF_ISP_IMSC.
* To use register names with standard convension, please use CIF_ISP_IMSC.
*/
#define	CIFISP_IMSC	(CIF_ISP_IMSC)

/** \brief  6CC, ISP Interrupt Set Register */
#define CIF_ISP_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ISR*)0xF90E25CCu)

/** Alias (User Manual Name) for CIF_ISP_ISR.
* To use register names with standard convension, please use CIF_ISP_ISR.
*/
#define	CIFISP_ISR	(CIF_ISP_ISR)

/** \brief  6C4, ISP Masked Interrupt Status Register */
#define CIF_ISP_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_MIS*)0xF90E25C4u)

/** Alias (User Manual Name) for CIF_ISP_MIS.
* To use register names with standard convension, please use CIF_ISP_MIS.
*/
#define	CIFISP_MIS	(CIF_ISP_MIS)

/** \brief  694, ISP Output Window Horizontal Offset Register */
#define CIF_ISP_OUT_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_H_OFFS*)0xF90E2594u)

/** Alias (User Manual Name) for CIF_ISP_OUT_H_OFFS.
* To use register names with standard convension, please use CIF_ISP_OUT_H_OFFS.
*/
#define	CIFISP_OUT_H_OFFS	(CIF_ISP_OUT_H_OFFS)

/** \brief  6AC, ISP Output Window Horizontal Offset Shadow Register */
#define CIF_ISP_OUT_H_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_H_OFFS_SHD*)0xF90E25ACu)

/** Alias (User Manual Name) for CIF_ISP_OUT_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_ISP_OUT_H_OFFS_SHD.
*/
#define	CIFISP_OUT_H_OFFS_SHD	(CIF_ISP_OUT_H_OFFS_SHD)

/** \brief  69C, ISP Output Horizontal Picture Size Register */
#define CIF_ISP_OUT_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_H_SIZE*)0xF90E259Cu)

/** Alias (User Manual Name) for CIF_ISP_OUT_H_SIZE.
* To use register names with standard convension, please use CIF_ISP_OUT_H_SIZE.
*/
#define	CIFISP_OUT_H_SIZE	(CIF_ISP_OUT_H_SIZE)

/** \brief  6B4, ISP Output Horizontal Picture Size Shadow Register */
#define CIF_ISP_OUT_H_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_H_SIZE_SHD*)0xF90E25B4u)

/** Alias (User Manual Name) for CIF_ISP_OUT_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_ISP_OUT_H_SIZE_SHD.
*/
#define	CIFISP_OUT_H_SIZE_SHD	(CIF_ISP_OUT_H_SIZE_SHD)

