lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_reg.h
/** \brief  698, ISP Output Window Vertical Offset Register */
#define CIF_ISP_OUT_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_V_OFFS*)0xF90E2598u)

/** Alias (User Manual Name) for CIF_ISP_OUT_V_OFFS.
* To use register names with standard convension, please use CIF_ISP_OUT_V_OFFS.
*/
#define	CIFISP_OUT_V_OFFS	(CIF_ISP_OUT_V_OFFS)

/** \brief  6B0, ISP Output Window Vertical Offset Shadow Register */
#define CIF_ISP_OUT_V_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_V_OFFS_SHD*)0xF90E25B0u)

/** Alias (User Manual Name) for CIF_ISP_OUT_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_ISP_OUT_V_OFFS_SHD.
*/
#define	CIFISP_OUT_V_OFFS_SHD	(CIF_ISP_OUT_V_OFFS_SHD)

/** \brief  6A0, ISP Output Vertical Picture Size Register */
#define CIF_ISP_OUT_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_V_SIZE*)0xF90E25A0u)

/** Alias (User Manual Name) for CIF_ISP_OUT_V_SIZE.
* To use register names with standard convension, please use CIF_ISP_OUT_V_SIZE.
*/
#define	CIFISP_OUT_V_SIZE	(CIF_ISP_OUT_V_SIZE)

/** \brief  6B8, ISP Output Vertical Picture Size Shadow Register */
#define CIF_ISP_OUT_V_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_V_SIZE_SHD*)0xF90E25B8u)

/** Alias (User Manual Name) for CIF_ISP_OUT_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_ISP_OUT_V_SIZE_SHD.
*/
#define	CIFISP_OUT_V_SIZE_SHD	(CIF_ISP_OUT_V_SIZE_SHD)

/** \brief  6C0, ISP Raw Interrupt Status Register */
#define CIF_ISP_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_RIS*)0xF90E25C0u)

/** Alias (User Manual Name) for CIF_ISP_RIS.
* To use register names with standard convension, please use CIF_ISP_RIS.
*/
#define	CIFISP_RIS	(CIF_ISP_RIS)

/** \brief  2400, ISP Image Stabilization Control Register */
#define CIF_ISPIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_CTRL*)0xF90E4300u)

/** Alias (User Manual Name) for CIF_ISPIS_CTRL.
* To use register names with standard convension, please use CIF_ISPIS_CTRL.
*/
#define	CIFISPIS_CTRL	(CIF_ISPIS_CTRL)

/** \brief  2420, ISP Image Stabilization Camera Displacement Register */
#define CIF_ISPIS_DISPLACE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_DISPLACE*)0xF90E4320u)

/** Alias (User Manual Name) for CIF_ISPIS_DISPLACE.
* To use register names with standard convension, please use CIF_ISPIS_DISPLACE.
*/
#define	CIFISPIS_DISPLACE	(CIF_ISPIS_DISPLACE)

/** \brief  2408, ISP Image Stabilization Horizontal Offset Of Output Window
 * Register */
#define CIF_ISPIS_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_H_OFFS*)0xF90E4308u)

/** Alias (User Manual Name) for CIF_ISPIS_H_OFFS.
* To use register names with standard convension, please use CIF_ISPIS_H_OFFS.
*/
#define	CIFISPIS_H_OFFS	(CIF_ISPIS_H_OFFS)

/** \brief  2424, SP Image Current Horizontal Offset Of Output Window Shadow
 * Register */
#define CIF_ISPIS_H_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_H_OFFS_SHD*)0xF90E4324u)

/** Alias (User Manual Name) for CIF_ISPIS_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_ISPIS_H_OFFS_SHD.
*/
#define	CIFISPIS_H_OFFS_SHD	(CIF_ISPIS_H_OFFS_SHD)

/** \brief  2410, ISP Image Stabilization Output Horizontal Picture Size
 * Register */
#define CIF_ISPIS_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_H_SIZE*)0xF90E4310u)

/** Alias (User Manual Name) for CIF_ISPIS_H_SIZE.
* To use register names with standard convension, please use CIF_ISPIS_H_SIZE.
*/
#define	CIFISPIS_H_SIZE	(CIF_ISPIS_H_SIZE)

/** \brief  242C, ISP Image Current Output Horizontal Picture Size Shadow
 * Register */
#define CIF_ISPIS_H_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_H_SIZE_SHD*)0xF90E432Cu)

/** Alias (User Manual Name) for CIF_ISPIS_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_ISPIS_H_SIZE_SHD.
*/
#define	CIFISPIS_H_SIZE_SHD	(CIF_ISPIS_H_SIZE_SHD)

/** \brief  2418, ISP Image Stabilization Maximum Horizontal Displacement
 * Register */
#define CIF_ISPIS_MAX_DX /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_MAX_DX*)0xF90E4318u)

/** Alias (User Manual Name) for CIF_ISPIS_MAX_DX.
* To use register names with standard convension, please use CIF_ISPIS_MAX_DX.
*/
#define	CIFISPIS_MAX_DX	(CIF_ISPIS_MAX_DX)

/** \brief  241C, ISP Image Stabilization Maximum Vertical Displacement Register */
#define CIF_ISPIS_MAX_DY /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_MAX_DY*)0xF90E431Cu)

/** Alias (User Manual Name) for CIF_ISPIS_MAX_DY.
* To use register names with standard convension, please use CIF_ISPIS_MAX_DY.
*/
#define	CIFISPIS_MAX_DY	(CIF_ISPIS_MAX_DY)

/** \brief  2404, ISP Image Stabilization Recenter Register */
#define CIF_ISPIS_RECENTER /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_RECENTER*)0xF90E4304u)

/** Alias (User Manual Name) for CIF_ISPIS_RECENTER.
* To use register names with standard convension, please use CIF_ISPIS_RECENTER.
*/
#define	CIFISPIS_RECENTER	(CIF_ISPIS_RECENTER)

/** \brief  240C, ISP Image Stabilization Vertical Offset Of Output Window
 * Register */
#define CIF_ISPIS_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_V_OFFS*)0xF90E430Cu)

/** Alias (User Manual Name) for CIF_ISPIS_V_OFFS.
* To use register names with standard convension, please use CIF_ISPIS_V_OFFS.
*/
#define	CIFISPIS_V_OFFS	(CIF_ISPIS_V_OFFS)

/** \brief  2428, ISP Image Current Vertical Offset Of Output Window Shadow
 * Register */
#define CIF_ISPIS_V_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_V_OFFS_SHD*)0xF90E4328u)

/** Alias (User Manual Name) for CIF_ISPIS_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_ISPIS_V_OFFS_SHD.
*/
#define	CIFISPIS_V_OFFS_SHD	(CIF_ISPIS_V_OFFS_SHD)

/** \brief  2414, ISP Image Stabilization Output Vertical Picture Size Register */
#define CIF_ISPIS_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_V_SIZE*)0xF90E4314u)

/** Alias (User Manual Name) for CIF_ISPIS_V_SIZE.
* To use register names with standard convension, please use CIF_ISPIS_V_SIZE.
*/
#define	CIFISPIS_V_SIZE	(CIF_ISPIS_V_SIZE)

/** \brief  2430, ISP Image Current Output Vertical Picture Size Shadow Register */
#define CIF_ISPIS_V_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_V_SIZE_SHD*)0xF90E4330u)

/** Alias (User Manual Name) for CIF_ISPIS_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_ISPIS_V_SIZE_SHD.
*/
#define	CIFISPIS_V_SIZE_SHD	(CIF_ISPIS_V_SIZE_SHD)

