lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_reg.h
/** \brief  1938, JPE Huffman Table Selector For AC Values Register */
#define CIF_JPE_AC_TABLE_SELECT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_AC_TABLE_SELECT*)0xF90E3838u)

/** Alias (User Manual Name) for CIF_JPE_AC_TABLE_SELECT.
* To use register names with standard convension, please use CIF_JPE_AC_TABLE_SELECT.
*/
#define	CIFJPE_AC_TABLE_SELECT	(CIF_JPE_AC_TABLE_SELECT)

/** \brief  1910, JPE Cb/Cr Value Scaling Control Register */
#define CIF_JPE_CBCR_SCALE_EN /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_CBCR_SCALE_EN*)0xF90E3810u)

/** Alias (User Manual Name) for CIF_JPE_CBCR_SCALE_EN.
* To use register names with standard convension, please use CIF_JPE_CBCR_SCALE_EN.
*/
#define	CIFJPE_CBCR_SCALE_EN	(CIF_JPE_CBCR_SCALE_EN)

/** \brief  1934, JPE Huffman Table Selector For DC Values Register */
#define CIF_JPE_DC_TABLE_SELECT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_DC_TABLE_SELECT*)0xF90E3834u)

/** Alias (User Manual Name) for CIF_JPE_DC_TABLE_SELECT.
* To use register names with standard convension, please use CIF_JPE_DC_TABLE_SELECT.
*/
#define	CIFJPE_DC_TABLE_SELECT	(CIF_JPE_DC_TABLE_SELECT)

/** \brief  1964, JPE Debug Information Register */
#define CIF_JPE_DEBUG /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_DEBUG*)0xF90E3864u)

/** Alias (User Manual Name) for CIF_JPE_DEBUG.
* To use register names with standard convension, please use CIF_JPE_DEBUG.
*/
#define	CIFJPE_DEBUG	(CIF_JPE_DEBUG)

/** \brief  1918, JPEG Codec Horizontal Image Size For Encoding Register */
#define CIF_JPE_ENC_HSIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ENC_HSIZE*)0xF90E3818u)

/** Alias (User Manual Name) for CIF_JPE_ENC_HSIZE.
* To use register names with standard convension, please use CIF_JPE_ENC_HSIZE.
*/
#define	CIFJPE_ENC_HSIZE	(CIF_JPE_ENC_HSIZE)

/** \brief  191C, JPEG Codec Vertical Image Size For Encoding Register */
#define CIF_JPE_ENC_VSIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ENC_VSIZE*)0xF90E381Cu)

/** Alias (User Manual Name) for CIF_JPE_ENC_VSIZE.
* To use register names with standard convension, please use CIF_JPE_ENC_VSIZE.
*/
#define	CIFJPE_ENC_VSIZE	(CIF_JPE_ENC_VSIZE)

/** \brief  1904, JPE Start Command To Start JFIF Stream Encoding Register */
#define CIF_JPE_ENCODE /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ENCODE*)0xF90E3804u)

/** Alias (User Manual Name) for CIF_JPE_ENCODE.
* To use register names with standard convension, please use CIF_JPE_ENCODE.
*/
#define	CIFJPE_ENCODE	(CIF_JPE_ENCODE)

/** \brief  1960, JPE Encode Mode Register */
#define CIF_JPE_ENCODE_MODE /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ENCODE_MODE*)0xF90E3860u)

/** Alias (User Manual Name) for CIF_JPE_ENCODE_MODE.
* To use register names with standard convension, please use CIF_JPE_ENCODE_MODE.
*/
#define	CIFJPE_ENCODE_MODE	(CIF_JPE_ENCODE_MODE)

/** \brief  1958, JPE Encoder Status Flag Register */
#define CIF_JPE_ENCODER_BUSY /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ENCODER_BUSY*)0xF90E3858u)

/** Alias (User Manual Name) for CIF_JPE_ENCODER_BUSY.
* To use register names with standard convension, please use CIF_JPE_ENCODER_BUSY.
*/
#define	CIFJPE_ENCODER_BUSY	(CIF_JPE_ENCODER_BUSY)

/** \brief  1974, JPE Error Interrupt Clear Register */
#define CIF_JPE_ERROR_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ERROR_ICR*)0xF90E3874u)

/** Alias (User Manual Name) for CIF_JPE_ERROR_ICR.
* To use register names with standard convension, please use CIF_JPE_ERROR_ICR.
*/
#define	CIFJPE_ERROR_ICR	(CIF_JPE_ERROR_ICR)

/** \brief  1968, JPE Error Interrupt Mask Register */
#define CIF_JPE_ERROR_IMR /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ERROR_IMR*)0xF90E3868u)

/** Alias (User Manual Name) for CIF_JPE_ERROR_IMR.
* To use register names with standard convension, please use CIF_JPE_ERROR_IMR.
*/
#define	CIFJPE_ERROR_IMR	(CIF_JPE_ERROR_IMR)

/** \brief  1978, JPE Error Interrupt Set Register */
#define CIF_JPE_ERROR_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ERROR_ISR*)0xF90E3878u)

/** Alias (User Manual Name) for CIF_JPE_ERROR_ISR.
* To use register names with standard convension, please use CIF_JPE_ERROR_ISR.
*/
#define	CIFJPE_ERROR_ISR	(CIF_JPE_ERROR_ISR)

/** \brief  1970, JPE Error Masked Interrupt Status Register */
#define CIF_JPE_ERROR_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ERROR_MIS*)0xF90E3870u)

/** Alias (User Manual Name) for CIF_JPE_ERROR_MIS.
* To use register names with standard convension, please use CIF_JPE_ERROR_MIS.
*/
#define	CIFJPE_ERROR_MIS	(CIF_JPE_ERROR_MIS)

/** \brief  196C, JPE Error Raw Interrupt Status Register */
#define CIF_JPE_ERROR_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_ERROR_RIS*)0xF90E386Cu)

/** Alias (User Manual Name) for CIF_JPE_ERROR_RIS.
* To use register names with standard convension, please use CIF_JPE_ERROR_RIS.
*/
#define	CIFJPE_ERROR_RIS	(CIF_JPE_ERROR_RIS)

/** \brief  1900, JPE Command To Start Stream Header Generation Register */
#define CIF_JPE_GEN_HEADER /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_GEN_HEADER*)0xF90E3800u)

/** Alias (User Manual Name) for CIF_JPE_GEN_HEADER.
* To use register names with standard convension, please use CIF_JPE_GEN_HEADER.
*/
#define	CIFJPE_GEN_HEADER	(CIF_JPE_GEN_HEADER)

/** \brief  195C, JPE Header Mode Definition Register */
#define CIF_JPE_HEADER_MODE /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_HEADER_MODE*)0xF90E385Cu)

/** Alias (User Manual Name) for CIF_JPE_HEADER_MODE.
* To use register names with standard convension, please use CIF_JPE_HEADER_MODE.
*/
#define	CIFJPE_HEADER_MODE	(CIF_JPE_HEADER_MODE)

/** \brief  1908, JPE Automatic Configuration Update Register */
#define CIF_JPE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_INIT*)0xF90E3808u)

/** Alias (User Manual Name) for CIF_JPE_INIT.
* To use register names with standard convension, please use CIF_JPE_INIT.
*/
#define	CIFJPE_INIT	(CIF_JPE_INIT)

/** \brief  1920, JPEG Picture Encoding Format Register */
#define CIF_JPE_PIC_FORMAT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_PIC_FORMAT*)0xF90E3820u)

/** Alias (User Manual Name) for CIF_JPE_PIC_FORMAT.
* To use register names with standard convension, please use CIF_JPE_PIC_FORMAT.
*/
#define	CIFJPE_PIC_FORMAT	(CIF_JPE_PIC_FORMAT)

/** \brief  1924, JPE Restart Marker Insertion Register */
#define CIF_JPE_RESTART_INTERVAL /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_RESTART_INTERVAL*)0xF90E3824u)

/** Alias (User Manual Name) for CIF_JPE_RESTART_INTERVAL.
* To use register names with standard convension, please use CIF_JPE_RESTART_INTERVAL.
*/
#define	CIFJPE_RESTART_INTERVAL	(CIF_JPE_RESTART_INTERVAL)

/** \brief  1988, JPEG Status Interrupt Clear Register */
#define CIF_JPE_STATUS_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_STATUS_ICR*)0xF90E3888u)

/** Alias (User Manual Name) for CIF_JPE_STATUS_ICR.
* To use register names with standard convension, please use CIF_JPE_STATUS_ICR.
*/
#define	CIFJPE_STATUS_ICR	(CIF_JPE_STATUS_ICR)

/** \brief  197C, JPEG Status Interrupt Mask Register */
#define CIF_JPE_STATUS_IMR /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_STATUS_IMR*)0xF90E387Cu)

