lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_reg.h
/** \brief  1538, Memory Interface Offset Counter Start Value For Main Picture
 * Cr Component Ring Buffer Register */
#define CIF_MI_MP_CR_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_OFFS_CNT_START*)0xF90E3438u)

/** Alias (User Manual Name) for CIF_MI_MP_CR_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MI_MP_CR_OFFS_CNT_START.
*/
#define	CIFMI_MP_CR_OFFS_CNT_START	(CIF_MI_MP_CR_OFFS_CNT_START)

/** \brief  1530, Memory Interface Size Of Main Picture Cr Component Ring Buffer
 * Register */
#define CIF_MI_MP_CR_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_SIZE_INIT*)0xF90E3430u)

/** Alias (User Manual Name) for CIF_MI_MP_CR_SIZE_INIT.
* To use register names with standard convension, please use CIF_MI_MP_CR_SIZE_INIT.
*/
#define	CIFMI_MP_CR_SIZE_INIT	(CIF_MI_MP_CR_SIZE_INIT)

/** \brief  1598, Memory Interface Size Shadow Register Of Main Picture Cr
 * Component Ring Buffer Register */
#define CIF_MI_MP_CR_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_SIZE_SHD*)0xF90E3498u)

/** Alias (User Manual Name) for CIF_MI_MP_CR_SIZE_SHD.
* To use register names with standard convension, please use CIF_MI_MP_CR_SIZE_SHD.
*/
#define	CIFMI_MP_CR_SIZE_SHD	(CIF_MI_MP_CR_SIZE_SHD)

/** \brief  1508, Memory Interface Base Address For Main Picture Y Component,
 * JPEG or RAW Data Register */
#define CIF_MI_MP_Y_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_BASE_AD_INIT*)0xF90E3408u)

/** Alias (User Manual Name) for CIF_MI_MP_Y_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MI_MP_Y_BASE_AD_INIT.
*/
#define	CIFMI_MP_Y_BASE_AD_INIT	(CIF_MI_MP_Y_BASE_AD_INIT)

/** \brief  1578, Memory Interface Base Address Shadow Register For Main Picture
 * Y Component, JPEG Register */
#define CIF_MI_MP_Y_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_BASE_AD_SHD*)0xF90E3478u)

/** Alias (User Manual Name) for CIF_MI_MP_Y_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MI_MP_Y_BASE_AD_SHD.
*/
#define	CIFMI_MP_Y_BASE_AD_SHD	(CIF_MI_MP_Y_BASE_AD_SHD)

/** \brief  1518, Memory Interface Fill Level Interrupt Offset Value For Main
 * Picture Y, JPEG or RAW Data Register */
#define CIF_MI_MP_Y_IRQ_OFFS_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT*)0xF90E3418u)

/** Alias (User Manual Name) for CIF_MI_MP_Y_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MI_MP_Y_IRQ_OFFS_INIT.
*/
#define	CIFMI_MP_Y_IRQ_OFFS_INIT	(CIF_MI_MP_Y_IRQ_OFFS_INIT)

/** \brief  1584, Memory Interface Shadow Register of Fill Level Interrupt
 * Offset Value For Main Picture Y Register */
#define CIF_MI_MP_Y_IRQ_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD*)0xF90E3484u)

/** Alias (User Manual Name) for CIF_MI_MP_Y_IRQ_OFFS_SHD.
* To use register names with standard convension, please use CIF_MI_MP_Y_IRQ_OFFS_SHD.
*/
#define	CIFMI_MP_Y_IRQ_OFFS_SHD	(CIF_MI_MP_Y_IRQ_OFFS_SHD)

/** \brief  1510, Memory Interface Offset Counter Init Value For Main Picture Y,
 * JPEG or RAW Data Register */
#define CIF_MI_MP_Y_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT*)0xF90E3410u)

/** Alias (User Manual Name) for CIF_MI_MP_Y_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MI_MP_Y_OFFS_CNT_INIT.
*/
#define	CIFMI_MP_Y_OFFS_CNT_INIT	(CIF_MI_MP_Y_OFFS_CNT_INIT)

/** \brief  1580, Memory Interface Current Offset Counter of Main Picture Y
 * Component JPEG or RAW Register */
#define CIF_MI_MP_Y_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD*)0xF90E3480u)

/** Alias (User Manual Name) for CIF_MI_MP_Y_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MI_MP_Y_OFFS_CNT_SHD.
*/
#define	CIFMI_MP_Y_OFFS_CNT_SHD	(CIF_MI_MP_Y_OFFS_CNT_SHD)

/** \brief  1514, Memory Interface Offset Counter Start Value For Main Picture
 * Y, JPEG or RAW Data Register */
#define CIF_MI_MP_Y_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_OFFS_CNT_START*)0xF90E3414u)

/** Alias (User Manual Name) for CIF_MI_MP_Y_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MI_MP_Y_OFFS_CNT_START.
*/
#define	CIFMI_MP_Y_OFFS_CNT_START	(CIF_MI_MP_Y_OFFS_CNT_START)

/** \brief  150C, Memory Interface Size of main picture Y component, JPEG or RAW
 * data Register */
#define CIF_MI_MP_Y_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_SIZE_INIT*)0xF90E340Cu)

/** Alias (User Manual Name) for CIF_MI_MP_Y_SIZE_INIT.
* To use register names with standard convension, please use CIF_MI_MP_Y_SIZE_INIT.
*/
#define	CIFMI_MP_Y_SIZE_INIT	(CIF_MI_MP_Y_SIZE_INIT)

/** \brief  157C, Memory Interface Size Shadow Register of Main Picture Y
 * Component,JPEG or RAW Data Register */
#define CIF_MI_MP_Y_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_Y_SIZE_SHD*)0xF90E347Cu)

/** Alias (User Manual Name) for CIF_MI_MP_Y_SIZE_SHD.
* To use register names with standard convension, please use CIF_MI_MP_Y_SIZE_SHD.
*/
#define	CIFMI_MP_Y_SIZE_SHD	(CIF_MI_MP_Y_SIZE_SHD)

/** \brief  15FC, MI Raw Interrupt Status Register */
#define CIF_MI_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_RIS*)0xF90E34FCu)

/** Alias (User Manual Name) for CIF_MI_RIS.
* To use register names with standard convension, please use CIF_MI_RIS.
*/
#define	CIFMI_RIS	(CIF_MI_RIS)

/** \brief  160C, MI Status Register */
#define CIF_MI_STATUS /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_STATUS*)0xF90E350Cu)

/** Alias (User Manual Name) for CIF_MI_STATUS.
* To use register names with standard convension, please use CIF_MI_STATUS.
*/
#define	CIFMI_STATUS	(CIF_MI_STATUS)

/** \brief  1610, MI Status Clear Register */
#define CIF_MI_STATUS_CLR /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_STATUS_CLR*)0xF90E3510u)

/** Alias (User Manual Name) for CIF_MI_STATUS_CLR.
* To use register names with standard convension, please use CIF_MI_STATUS_CLR.
*/
#define	CIFMI_STATUS_CLR	(CIF_MI_STATUS_CLR)

/** \brief  3608, Memory Interface Base Address For Extra Path Data Buffer
 * Register */
#define CIF_MIEP_CH_1S0_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_BASE_AD_INIT*)0xF90E5508u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_BASE_AD_INIT.
*/
#define	CIFMIEP_1_BASE_AD_INIT	(CIF_MIEP_CH_1S0_BASE_AD_INIT)

/** \brief  3620, Memory Interface Base Address Shadow Register for Extra Path
 * Buffer Register */
#define CIF_MIEP_CH_1S0_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_BASE_AD_SHD*)0xF90E5520u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S0_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S0_BASE_AD_SHD.
*/
#define	CIFMIEP_1_BASE_AD_SHD	(CIF_MIEP_CH_1S0_BASE_AD_SHD)

/** \brief  3600, Memory Interface Extra Path Control Register */
#define CIF_MIEP_CH_1S0_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_CTRL*)0xF90E5500u)

